HAMES2-1st-3/TunnelComfortSystemTesting/include/tc38xa/IfxCcu6_bf.h
/** \brief Length for Ifx_CCU6_IEN_Bits.ENT12PM */
#define IFX_CCU6_IEN_ENT12PM_LEN (1u)

/** \brief Mask for Ifx_CCU6_IEN_Bits.ENT12PM */
#define IFX_CCU6_IEN_ENT12PM_MSK (0x1u)

/** \brief Offset for Ifx_CCU6_IEN_Bits.ENT12PM */
#define IFX_CCU6_IEN_ENT12PM_OFF (7u)

/** \brief Length for Ifx_CCU6_IEN_Bits.ENT13CM */
#define IFX_CCU6_IEN_ENT13CM_LEN (1u)

/** \brief Mask for Ifx_CCU6_IEN_Bits.ENT13CM */
#define IFX_CCU6_IEN_ENT13CM_MSK (0x1u)

/** \brief Offset for Ifx_CCU6_IEN_Bits.ENT13CM */
#define IFX_CCU6_IEN_ENT13CM_OFF (8u)

/** \brief Length for Ifx_CCU6_IEN_Bits.ENT13PM */
#define IFX_CCU6_IEN_ENT13PM_LEN (1u)

/** \brief Mask for Ifx_CCU6_IEN_Bits.ENT13PM */
#define IFX_CCU6_IEN_ENT13PM_MSK (0x1u)

/** \brief Offset for Ifx_CCU6_IEN_Bits.ENT13PM */
#define IFX_CCU6_IEN_ENT13PM_OFF (9u)

/** \brief Length for Ifx_CCU6_IEN_Bits.ENTRPF */
#define IFX_CCU6_IEN_ENTRPF_LEN (1u)

/** \brief Mask for Ifx_CCU6_IEN_Bits.ENTRPF */
#define IFX_CCU6_IEN_ENTRPF_MSK (0x1u)

/** \brief Offset for Ifx_CCU6_IEN_Bits.ENTRPF */
#define IFX_CCU6_IEN_ENTRPF_OFF (10u)

/** \brief Length for Ifx_CCU6_IEN_Bits.ENCHE */
#define IFX_CCU6_IEN_ENCHE_LEN (1u)

/** \brief Mask for Ifx_CCU6_IEN_Bits.ENCHE */
#define IFX_CCU6_IEN_ENCHE_MSK (0x1u)

/** \brief Offset for Ifx_CCU6_IEN_Bits.ENCHE */
#define IFX_CCU6_IEN_ENCHE_OFF (12u)

/** \brief Length for Ifx_CCU6_IEN_Bits.ENWHE */
#define IFX_CCU6_IEN_ENWHE_LEN (1u)

/** \brief Mask for Ifx_CCU6_IEN_Bits.ENWHE */
#define IFX_CCU6_IEN_ENWHE_MSK (0x1u)

/** \brief Offset for Ifx_CCU6_IEN_Bits.ENWHE */
#define IFX_CCU6_IEN_ENWHE_OFF (13u)

/** \brief Length for Ifx_CCU6_IEN_Bits.ENIDLE */
#define IFX_CCU6_IEN_ENIDLE_LEN (1u)

/** \brief Mask for Ifx_CCU6_IEN_Bits.ENIDLE */
#define IFX_CCU6_IEN_ENIDLE_MSK (0x1u)

/** \brief Offset for Ifx_CCU6_IEN_Bits.ENIDLE */
#define IFX_CCU6_IEN_ENIDLE_OFF (14u)

/** \brief Length for Ifx_CCU6_IEN_Bits.ENSTR */
#define IFX_CCU6_IEN_ENSTR_LEN (1u)

/** \brief Mask for Ifx_CCU6_IEN_Bits.ENSTR */
#define IFX_CCU6_IEN_ENSTR_MSK (0x1u)

/** \brief Offset for Ifx_CCU6_IEN_Bits.ENSTR */
#define IFX_CCU6_IEN_ENSTR_OFF (15u)

/** \brief Length for Ifx_CCU6_OCS_Bits.TGS */
#define IFX_CCU6_OCS_TGS_LEN (2u)

/** \brief Mask for Ifx_CCU6_OCS_Bits.TGS */
#define IFX_CCU6_OCS_TGS_MSK (0x3u)

/** \brief Offset for Ifx_CCU6_OCS_Bits.TGS */
#define IFX_CCU6_OCS_TGS_OFF (0u)

/** \brief Length for Ifx_CCU6_OCS_Bits.TGB */
#define IFX_CCU6_OCS_TGB_LEN (1u)

/** \brief Mask for Ifx_CCU6_OCS_Bits.TGB */
#define IFX_CCU6_OCS_TGB_MSK (0x1u)

/** \brief Offset for Ifx_CCU6_OCS_Bits.TGB */
#define IFX_CCU6_OCS_TGB_OFF (2u)

/** \brief Length for Ifx_CCU6_OCS_Bits.TG_P */
#define IFX_CCU6_OCS_TG_P_LEN (1u)

/** \brief Mask for Ifx_CCU6_OCS_Bits.TG_P */
#define IFX_CCU6_OCS_TG_P_MSK (0x1u)

/** \brief Offset for Ifx_CCU6_OCS_Bits.TG_P */
#define IFX_CCU6_OCS_TG_P_OFF (3u)

/** \brief Length for Ifx_CCU6_OCS_Bits.SUS */
#define IFX_CCU6_OCS_SUS_LEN (4u)

/** \brief Mask for Ifx_CCU6_OCS_Bits.SUS */
#define IFX_CCU6_OCS_SUS_MSK (0xfu)

/** \brief Offset for Ifx_CCU6_OCS_Bits.SUS */
#define IFX_CCU6_OCS_SUS_OFF (24u)

/** \brief Length for Ifx_CCU6_OCS_Bits.SUS_P */
#define IFX_CCU6_OCS_SUS_P_LEN (1u)

/** \brief Mask for Ifx_CCU6_OCS_Bits.SUS_P */
#define IFX_CCU6_OCS_SUS_P_MSK (0x1u)

/** \brief Offset for Ifx_CCU6_OCS_Bits.SUS_P */
#define IFX_CCU6_OCS_SUS_P_OFF (28u)

/** \brief Length for Ifx_CCU6_OCS_Bits.SUSSTA */
#define IFX_CCU6_OCS_SUSSTA_LEN (1u)

/** \brief Mask for Ifx_CCU6_OCS_Bits.SUSSTA */
#define IFX_CCU6_OCS_SUSSTA_MSK (0x1u)

/** \brief Offset for Ifx_CCU6_OCS_Bits.SUSSTA */
#define IFX_CCU6_OCS_SUSSTA_OFF (29u)

/** \brief Length for Ifx_CCU6_KRSTCLR_Bits.CLR */
#define IFX_CCU6_KRSTCLR_CLR_LEN (1u)

/** \brief Mask for Ifx_CCU6_KRSTCLR_Bits.CLR */
#define IFX_CCU6_KRSTCLR_CLR_MSK (0x1u)

/** \brief Offset for Ifx_CCU6_KRSTCLR_Bits.CLR */
#define IFX_CCU6_KRSTCLR_CLR_OFF (0u)

/** \brief Length for Ifx_CCU6_KRST1_Bits.RST */
#define IFX_CCU6_KRST1_RST_LEN (1u)

/** \brief Mask for Ifx_CCU6_KRST1_Bits.RST */
#define IFX_CCU6_KRST1_RST_MSK (0x1u)

/** \brief Offset for Ifx_CCU6_KRST1_Bits.RST */
#define IFX_CCU6_KRST1_RST_OFF (0u)

/** \brief Length for Ifx_CCU6_KRST0_Bits.RST */
#define IFX_CCU6_KRST0_RST_LEN (1u)

/** \brief Mask for Ifx_CCU6_KRST0_Bits.RST */
#define IFX_CCU6_KRST0_RST_MSK (0x1u)

/** \brief Offset for Ifx_CCU6_KRST0_Bits.RST */
#define IFX_CCU6_KRST0_RST_OFF (0u)

/** \brief Length for Ifx_CCU6_KRST0_Bits.RSTSTAT */
#define IFX_CCU6_KRST0_RSTSTAT_LEN (1u)

/** \brief Mask for Ifx_CCU6_KRST0_Bits.RSTSTAT */
#define IFX_CCU6_KRST0_RSTSTAT_MSK (0x1u)

/** \brief Offset for Ifx_CCU6_KRST0_Bits.RSTSTAT */
#define IFX_CCU6_KRST0_RSTSTAT_OFF (1u)

/** \brief Length for Ifx_CCU6_ACCEN0_Bits.EN0 */
#define IFX_CCU6_ACCEN0_EN0_LEN (1u)

/** \brief Mask for Ifx_CCU6_ACCEN0_Bits.EN0 */
#define IFX_CCU6_ACCEN0_EN0_MSK (0x1u)

/** \brief Offset for Ifx_CCU6_ACCEN0_Bits.EN0 */
#define IFX_CCU6_ACCEN0_EN0_OFF (0u)

/** \brief Length for Ifx_CCU6_ACCEN0_Bits.EN1 */
#define IFX_CCU6_ACCEN0_EN1_LEN (1u)

/** \brief Mask for Ifx_CCU6_ACCEN0_Bits.EN1 */
#define IFX_CCU6_ACCEN0_EN1_MSK (0x1u)

/** \brief Offset for Ifx_CCU6_ACCEN0_Bits.EN1 */
#define IFX_CCU6_ACCEN0_EN1_OFF (1u)

/** \brief Length for Ifx_CCU6_ACCEN0_Bits.EN2 */
#define IFX_CCU6_ACCEN0_EN2_LEN (1u)

/** \brief Mask for Ifx_CCU6_ACCEN0_Bits.EN2 */
#define IFX_CCU6_ACCEN0_EN2_MSK (0x1u)

/** \brief Offset for Ifx_CCU6_ACCEN0_Bits.EN2 */
#define IFX_CCU6_ACCEN0_EN2_OFF (2u)

/** \brief Length for Ifx_CCU6_ACCEN0_Bits.EN3 */
#define IFX_CCU6_ACCEN0_EN3_LEN (1u)

/** \brief Mask for Ifx_CCU6_ACCEN0_Bits.EN3 */
#define IFX_CCU6_ACCEN0_EN3_MSK (0x1u)

/** \brief Offset for Ifx_CCU6_ACCEN0_Bits.EN3 */
#define IFX_CCU6_ACCEN0_EN3_OFF (3u)

/** \brief Length for Ifx_CCU6_ACCEN0_Bits.EN4 */
#define IFX_CCU6_ACCEN0_EN4_LEN (1u)

/** \brief Mask for Ifx_CCU6_ACCEN0_Bits.EN4 */
#define IFX_CCU6_ACCEN0_EN4_MSK (0x1u)

/** \brief Offset for Ifx_CCU6_ACCEN0_Bits.EN4 */
#define IFX_CCU6_ACCEN0_EN4_OFF (4u)

/** \brief Length for Ifx_CCU6_ACCEN0_Bits.EN5 */
#define IFX_CCU6_ACCEN0_EN5_LEN (1u)

